# Taps
tap 'homebrew/bundle'
tap 'nikitabobko/tap'
tap 'oven-sh/bun'
tap 'morantron/tmux-fingers'
tap 'FelixKratz/formulae'
tap 'espanso/espanso'
# CLI tools
brew 'git'
brew 'git-delta'
brew 'tmux'
brew 'neovim'
brew 'zsh'
brew 'fzf'
brew 'bat'
brew 'eza'
brew 'wget'
# brew 'mpv'        # Added for video playback
# brew 'mediainfo'  # Added for media file information
brew 'zoxide'
brew 'colima'
brew 'lazydocker'
brew 'tree'
brew 'btop'
brew 'lazygit'
brew 'sketchybar'
brew 'dust'
brew 'gum'
brew 'stow'
brew 'morantron/tmux-fingers/tmux-fingers'
brew 'lazysql'  
brew 'termscp'
brew 'clipper' 
brew 'ncdu'
brew 'tailscale'
# brew 'television'
brew 'insect'
brew 'rclone'
brew 'unison'
brew 'forgit'
brew 'zk'
brew 'pandoc'
brew 'poppler'
brew 'regclient'
brew 'fancy-cat'
# brew 'tabiew'
# brew 'visidata' # use cmd-s for settings navigation
# brew 'gcalcli'
# brew 'fpc'
# brew 'swi-prolog'
# brew 'sk'
# brew 'gping'
# brew 'bandwhich'

# Languages and runtimes
brew 'python'
brew 'node'
brew 'bun'
brew 'uv'
brew 'go'
brew 'luarocks'
brew 'rbenv'
brew 'rust'
brew 'ghc'
# brew 'cabal-install'
# brew 'haskell-stack'
# brew 'haskell-language-server'
# Casks (GUI applications)
cask 'kitty'
cask 'karabiner-elements'
cask 'raycast'
cask 'wezterm'
cask 'aerospace'
cask 'iina' # Added optional modern video player for macOS
cask 'espanso'
# Additional tools
brew 'ripgrep'
brew 'fd'
# Docker-related tools
brew 'docker'
brew 'docker-compose'
# GitHub CLI
brew 'gh'
brew 'hexyl'
brew 'ouch'
# SML/NJ
cask 'smlnj'

# Sublime Text
cask 'sublime-text'

# Fonts
cask 'font-meslo-lg-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-sf-pro'
cask 'sf-symbols'

