# Taps
tap "homebrew/bundle"
tap "nikitabobko/tap"
tap "withgraphite/tap"
tap "oven-sh/bun"  # New tap for Bun

# CLI tools
brew "git"
brew "git-delta"
brew "tmux"
brew "neovim"
brew "zsh"
brew "fzf"
brew "bat"
brew "eza"
brew "yazi"
brew "zoxide"
brew "colima"
brew "lazydocker"
brew "tree"
brew "bpytop"
brew "lazygit"
brew "graphite"
brew "dust"

# Languages and runtimes
brew "python"
brew "node"
brew "bun"  # Added Bun
brew "uv"
brew "go"
brew "luarocks"

# Casks (GUI applications)
cask "kitty"
cask "karabiner-elements"
cask "raycast"
cask "wezterm"
cask "aerospace"

# Additional tools
brew "ripgrep"
brew "fd"

# Docker-related tools
brew "docker"
brew "docker-compose"

# GitHub CLI
brew "gh"
