# Taps
tap 'homebrew/bundle'
tap 'nikitabobko/tap'
tap 'withgraphite/tap'
tap 'oven-sh/bun'
tap 'morantron/tmux-fingers'
# CLI tools
brew 'git'
brew 'git-delta'
brew 'tmux'
brew 'neovim'
brew 'zsh'
brew 'fzf'
brew 'bat'
brew 'eza'
brew 'yazi'
brew 'mpv'        # Added for video playback
brew 'mediainfo'  # Added for media file information
brew 'zoxide'
brew 'colima'
brew 'lazydocker'
brew 'tree'
brew 'bpytop'
brew 'lazygit'
brew 'graphite'
brew 'dust'
brew 'gum'
brew 'stow'
brew 'timewarrior'
brew 'task'
brew 'taskwarrior-tui'
brew 'morantron/tmux-fingers/tmux-fingers'
brew 'lazysql'  
brew 'termscp'
brew 'clipper' 
brew 'ncdu'
brew 'tailscale'
brew 'television'
brew 'insect'

# Languages and runtimes
brew 'python'
brew 'node'
brew 'bun'
brew 'uv'
brew 'go'
brew 'luarocks'
brew 'rbenv'
brew 'rust'
brew 'ghc'
brew 'cabal-install'
brew 'haskell-stack'
brew 'haskell-language-server'
# Casks (GUI applications)
cask 'kitty'
cask 'karabiner-elements'
cask 'raycast'
cask 'wezterm'
cask 'aerospace'
cask 'iina' # Added optional modern video player for macOS
# Additional tools
brew 'ripgrep'
brew 'fd'
# Docker-related tools
brew 'docker'
brew 'docker-compose'
# GitHub CLI
brew 'gh'
